# SegmentsAngleTooGreatWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..SegmentsAngleTooGreatWarning Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The resulting angle between the segments is too great.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SegmentsAngleTooGreatWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SegmentsAngleTooGreatWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SegmentsAngleTooGreatWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace